abb.html
<!DOCTYPE html>
<html>
<head>
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>Práctica 4: Árboles binarios de búsqueda</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Dato Simó">
<link rel="stylesheet" type="text/css" href="css/org.css">
</head>
<body>
<div id="content">
<h1 class="title">Práctica 4: Árboles binarios de búsqueda</h1>
<div id="table-of-contents">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#ListaInt">1. Lista recursiva</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2 ejercicios">
<h2 id="ListaInt"><a id="orgheadline1"></a><span class="section-number-2">1</span> Lista recursiva</h2>
<div class="outline-text-2" id="text-ListaInt">
<p>
Una lista enlazada es una estructura recursiva porque su <i>Nodo</i> se apunta a sí
mismo:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #859900;">class</span> <span style="color: #b58900;">Nodo</span>
{
    <span style="color: #b58900;">Integer</span> <span style="color: #268bd2;">valor</span>;
    <span style="color: #b58900;">Nodo</span> <span style="color: #268bd2;">siguiente</span>;  <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75;">Recursi&#243;n en la estructura.</span>
}
</pre>
</div>

<p>
En general, las primitivas de la lista enlazada se implementan de manera
iterativa; pero también se pueden escribir de manera recursiva.
</p>

<p>
La implementación iterativa a continuación emplea funciones auxiliares para
facilitar luego la conversión a recursiva.
</p>

<ol class="org-ol">
<li><p>
La clase <i>ListaInt</i> implementa las primitivas <code>agregar()</code>, <code>largo()</code> y
<code>quitarUltimo()</code> mediante funciones auxiliares a las que pasa el primer
elemento:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #859900;">private</span> <span style="color: #b58900;">Nodo</span> <span style="color: #268bd2;">primero</span>;

<span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75;">Devuelve el largo de la lista.</span>
<span style="color: #859900;">public</span> <span style="color: #b58900;">int</span> <span style="color: #268bd2;">largo</span>() {
    <span style="color: #859900;">return</span> largoAux(primero);
}

<span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75;">Inserta un elemento al final de la lista.</span>
<span style="color: #859900;">public</span> <span style="color: #b58900;">void</span> <span style="color: #268bd2;">agregar</span>(<span style="color: #b58900;">Integer</span> <span style="color: #268bd2;">x</span>) {
    <span style="color: #859900;">if</span> (primero == <span style="color: #268bd2; font-weight: bold;">null</span>)
        primero = <span style="color: #859900;">new</span> <span style="color: #b58900;">Nodo</span>(x, <span style="color: #268bd2; font-weight: bold;">null</span>);
    <span style="color: #859900;">else</span>
        agregarAux(primero, x);
}

<span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75;">Elimina el &#250;ltimo elemento de la lista, y lo devuelve.</span>
<span style="color: #859900;">public</span> <span style="color: #b58900;">Integer</span> <span style="color: #268bd2;">eliminarUltimo</span>() {
    <span style="color: #859900;">if</span> (primero == <span style="color: #268bd2; font-weight: bold;">null</span>) {
        <span style="color: #859900;">return</span> <span style="color: #268bd2; font-weight: bold;">null</span>;
    }
    <span style="color: #859900;">else</span> <span style="color: #859900;">if</span> (primero.siguiente == <span style="color: #268bd2; font-weight: bold;">null</span>) {
        &lt;&lt;&#193;rbol con un solo nodo&gt;&gt;
    }
    <span style="color: #859900;">return</span> eliminarUltimoAux(primero, primero.siguiente);
}
</pre>
</div>

<p>
<b>Archivo</b>: <a href="abb/ListaInt.java">ListaInt.java</a>.
</p>

<p>
Se pide implementar, de manera iterativa, las funciones auxiliares de estas
primitivas:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75;">Funciones auxiliares, implementadas iterativamente.</span>

<span style="color: #859900;">protected</span> <span style="color: #b58900;">int</span> <span style="color: #268bd2;">largoAux</span>(<span style="color: #b58900;">Nodo</span> <span style="color: #268bd2;">nodo</span>) {
    <span style="color: #859900;">return</span> -1;
}

<span style="color: #859900;">protected</span> <span style="color: #b58900;">void</span> <span style="color: #268bd2;">agregarAux</span>(<span style="color: #b58900;">Nodo</span> <span style="color: #268bd2;">nodo</span>, <span style="color: #b58900;">Integer</span> <span style="color: #268bd2;">x</span>) {
}

<span style="color: #859900;">protected</span> <span style="color: #b58900;">Integer</span> <span style="color: #268bd2;">eliminarUltimoAux</span>(<span style="color: #b58900;">Nodo</span> <span style="color: #268bd2;">anterior</span>, <span style="color: #b58900;">Nodo</span> <span style="color: #268bd2;">actual</span>) {
    <span style="color: #859900;">return</span> <span style="color: #268bd2; font-weight: bold;">null</span>;
}
</pre>
</div></li>

<li><p>
Implementar las mismas funciones auxiliares de manera recursiva en una clase
<i>ListaIntRec</i>.
</p>

<p>
<b>Archivo</b>: <a href="abb/ListaIntRec.java">ListaIntRec.java</a>.
</p></li>
</ol>
</div>
</div>
</div>
</body>
</html>
